samples/retrieve_send_sms_mo_key_definition.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Header>
  <wsse:Security
   xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
     xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
   <wsu:Timestamp>
    <wsu:Created>2011-02-09T17:53:12Z</wsu:Created>
    <wsu:Expires>2011-02-09T17:58:12Z</wsu:Expires>
   </wsu:Timestamp>
   <wsse:UsernameToken>
    <wsse:Username>*******</wsse:Username>
    <wsse:Password
   Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">******</wsse:Password>
    <wsse:Nonce>Orl9wG69rtnWzKnfgc0+A59slrA=</wsse:Nonce>
    <wsu:Created>2011-02-09T17:53:12Z</wsu:Created>
   </wsse:UsernameToken>
  </wsse:Security>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
  <RetrieveRequestMsg xmlns="http://exacttarget.com/wsdl/partnerAPI">
   <RetrieveRequest>
    <ObjectType>SendSMSMOKeyword</ObjectType>
    <Properties>Client.ID</Properties>
    <Properties>Createddate</Properties>
    <Properties>ModifiedDate</Properties>
    <Properties>ObjectId</Properties>
    <Properties>IsDefaultKeyWord</Properties>
    <Properties>Message</Properties>
    <Properties>ScripterrorMessage</Properties>
   </RetrieveRequest>
  </RetrieveRequestMsg>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
